# Working with pandas
    -Data import/ export
    -data manipulation - filtering and selection
    -data wrangling, transformation
    -data cleaning
    
   Pandas has 2 data types:-
   
   -1. Pandas series
   
   -2. Pandas Dataframe

In [6]:
import pandas as pd

In [7]:
# creating a series

ps = pd.Series([25,36,28,45,26], name ='Age')
ps

0    25
1    36
2    28
3    45
4    26
Name: Age, dtype: int64

In [8]:
mydict = {"Name":['James', 'Jane','Jenny', 'John','Jason','Jack','Jessy', 'Johny'],
         "Age":[23,55,66,32,25,45,33,63],
         "Gender":['Male', 'Female', 'Female','Male','Male','Male','Female','Male']}

df = pd.DataFrame(mydict)
df

    Name  Age  Gender
0  James   23    Male
1   Jane   55  Female
2  Jenny   66  Female
3   John   32    Male
4  Jason   25    Male
5   Jack   45    Male
6  Jessy   33  Female
7  Johny   63    Male

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df['Name']

0    James
1     Jane
2    Jenny
3     John
4    Jason
5     Jack
6    Jessy
7    Johny
Name: Name, dtype: object

In [11]:
# we can say that dataframe is multiple pandas series
type(df['Name'])

pandas.core.series.Series

## Data selection

In [12]:
df

    Name  Age  Gender
0  James   23    Male
1   Jane   55  Female
2  Jenny   66  Female
3   John   32    Male
4  Jason   25    Male
5   Jack   45    Male
6  Jessy   33  Female
7  Johny   63    Male

In [13]:
# to select the top 5 view of the dataset or rows
df.head()

    Name  Age  Gender
0  James   23    Male
1   Jane   55  Female
2  Jenny   66  Female
3   John   32    Male
4  Jason   25    Male

In [14]:
# select top 2 data set or row
df.head(2)

    Name  Age  Gender
0  James   23    Male
1   Jane   55  Female

In [15]:
# select bottom 3 rows
df.tail(3)

    Name  Age  Gender
5   Jack   45    Male
6  Jessy   33  Female
7  Johny   63    Male

In [16]:
# selecting columns
df.Name

0    James
1     Jane
2    Jenny
3     John
4    Jason
5     Jack
6    Jessy
7    Johny
Name: Name, dtype: object

In [17]:
# recommended
df['Name']

0    James
1     Jane
2    Jenny
3     John
4    Jason
5     Jack
6    Jessy
7    Johny
Name: Name, dtype: object

In [18]:
# for multiple coloumn selection
df[['Name','Gender']]

    Name  Gender
0  James    Male
1   Jane  Female
2  Jenny  Female
3   John    Male
4  Jason    Male
5   Jack    Male
6  Jessy  Female
7  Johny    Male

In [19]:
# selecting rows
df[2:6]

    Name  Age  Gender
2  Jenny   66  Female
3   John   32    Male
4  Jason   25    Male
5   Jack   45    Male

In [20]:
df.loc[2:6,'Age']

2    66
3    32
4    25
5    45
6    33
Name: Age, dtype: int64

In [21]:
df.iloc[2:6,1:3]

   Age  Gender
2   66  Female
3   32    Male
4   25    Male
5   45    Male

## Filtering

In [22]:
df

    Name  Age  Gender
0  James   23    Male
1   Jane   55  Female
2  Jenny   66  Female
3   John   32    Male
4  Jason   25    Male
5   Jack   45    Male
6  Jessy   33  Female
7  Johny   63    Male

In [23]:
# numeric filter
df[df.Age<30]

    Name  Age Gender
0  James   23   Male
4  Jason   25   Male

In [24]:
# categoric filter
df[df.Gender=="Male"]

    Name  Age Gender
0  James   23   Male
3   John   32   Male
4  Jason   25   Male
5   Jack   45   Male
7  Johny   63   Male

In [26]:
# categoric filter
df[df.Gender!="Male"]

    Name  Age  Gender
1   Jane   55  Female
2  Jenny   66  Female
6  Jessy   33  Female

In [27]:
# combining conditions
df[df.Gender=='Male'][df.Age>30]

C:\Users\Hemant Kumar\AppData\Local\Temp\ipykernel_10844\366733835.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df.Gender=='Male'][df.Age>30]

    Name  Age Gender
3   John   32   Male
5   Jack   45   Male
7  Johny   63   Male

In [28]:
# combining conditions -AND
df[(df.Age>30) & (df.Gender=='Male')]

    Name  Age Gender
3   John   32   Male
5   Jack   45   Male
7  Johny   63   Male

In [29]:
# combining conditions -OR
df[(df.Age>30) | (df.Gender=='Male')]

    Name  Age  Gender
0  James   23    Male
1   Jane   55  Female
2  Jenny   66  Female
3   John   32    Male
4  Jason   25    Male
5   Jack   45    Male
6  Jessy   33  Female
7  Johny   63    Male